In [10]:
import pandas as pd

In [12]:
dataset = '../data/student_grades.csv'
pd.read_csv(dataset)

       Student ID              Course Grade
0               1                Math     F
1               1             Science     C
2               1             History     A
3               1             English     F
4               1  Physical Education     C
...           ...                 ...   ...
49995       10000                Math     D
49996       10000             Science     F
49997       10000             History     B
49998       10000             English     F
49999       10000  Physical Education     F

[50000 rows x 3 columns]

## Análise exploratória inicial:

In [14]:
# Verificar as primeiras linhas do DataFrame.

df.head() # head retorna as 5 primeiras linhas

   Student ID              Course Grade
0           1                Math     F
1           1             Science     C
2           1             History     A
3           1             English     F
4           1  Physical Education     C

In [15]:
# Verificar o tipo de dados de cada coluna.

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student ID  50000 non-null  int64
 1   Course      50000 non-null  object
 2   Grade       50000 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [16]:
# Verificar se há valores nulos.

df.isnull().sum()

# Não temos valores nulos, o que é ótimo.

Student ID    0
Course        0
Grade         0
dtype: int64

In [17]:
# Analisar estatísticas básicas das colunas numéricas.

df.describe()

         Student ID
count  50000.000000
mean    5000.500000
std     2886.780199
min        1.000000
25%     2500.750000
50%     5000.500000
75%     7500.250000
max    10000.000000

## Explicação das estatísticas básicas:

### count

Contagem total de registros

### mean

Média Aritmética

### std

Desvio Padrão (Moda) 

### min

Valor mínimo na coluna

### 25%

Primeiro quartil (Q1)

### 50%

Mediana / Segundo quartil (Q2)

### 75%

Terceiro quartil (Q3)

### max

Valor máximo na coluna